name = input()
print('Привет,', name)

team_name = input()
print(team_name, '- чемпион!')



variables1 = 'I was'
variables2 = 'born'
variables3 = 'this way'
print(variables1)
print(variables2)
print(variables3)



#Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, а затем выводит их в той же последовательности, каждую на отдельной строке.
#Test input:
#I
#was born
#this way

variables1=input()
variables2=input()
variables3=input()
print(variables1)
print(variables2)
print(variables3)

#Для вывода данных в обратном порядке

text1 = input()
text2 = input()
text3 = input()
print(text3)
print(text2)
print(text1)
