 //Спрашивает имя и приветствует пользовател
   
   name = input("Введите ваше имя: ")
   print(f"Привет, {name}!")
   

 //Запрашивает два числа и выводит их сумму.
   
   num1 = float(input("Введите первое число: "))
   num2 = float(input("Введите второе число: "))
   result = num1 + num2
   print(f"Сумма: {result}")
   

//Запрашивает строку и выводит количество её символов.
  
   user_input = input("Введите строку: ")
   length = len(user_input)
   print(f"Количество символов в строке: {length}")
 

 //Запрашивает число и определяет, является ли оно четным или нечетным.
  
   number = int(input("Введите целое число: "))
   if number % 2 == 0:
       print("Число четное.")
   else:
       print("Число нечетное.")
   
// Запрашивает число и выводит его квадрат.
  
   number = float(input("Введите число: "))
   square = number ** 2
   print(f"Квадрат числа: {square}")


//Запрашивает строку и выводит её в обратном порядке.

   user_input = input("Введите строку: ")
   reversed_string = user_input[::-1]
   print(f"Обратная строка: {reversed_string}")
 

8. //Запрашивает год рождения и вычисляет возраст.
   
   birth_year = int(input("Введите ваш год рождения: "))
   current_year = 2025
   age = current_year - birth_year
   print(f"Ваш возраст: {age} лет.")


//Запрашивает температуру в Цельсии и переводит в Фаренгейт.

   celsius = float(input("Введите температуру в градусах Цельсия: "))
   fahrenheit = celsius * 9/5 + 32
   print(f"Температура в Фаренгейтах: {fahrenheit}")
  
//Запрашивает имя, животное и звук, затем формирует предложение.
    
    name = input("Введите имя: ")
    animal = input("Введите животное: ")
    sound = input("Введите звук, который оно издает: ")
    print(f"{name} - это {animal}, которое говорит {sound}!")
   

